{
    "@context" : "http://schema.org",
    "@type" : "Article",
    "name" : "5 Digital Marketing Tips for Small Businesses",
    "author" : {
        "@type" : "Person",
        "name" : "Liam Haley"
    },
    "dataPublished": "2018-05-31",
    "image" : "https://tryvitris.com/assets/img/digital-marketing.png",
    "articleSection": "Marketing",
    "articleBody": "Digital marketing is vital to the success of any small business that dreams of remaining competitive in the industry. Everything has gone digital, and unless small businesses can adapt, they might as well close shop and find other things to do. Here is a brief at what small businesses should be thinking about when considering digital marketing: A website is the starting point of digital marketing for small businesses. It is the website that will give them an online presence which they can then capitalize on for more growth. Therefore, the business must have a well-designed website with clear navigation and a mobile friendly platform. The website must have fresh, original, and compelling content so that users will find real information and answers to their problems. Having such content will be helpful with search engine optimization so that free and targeted traffic heads to your site. If the small business is targeting local consumers with their products and services, then it must claim the local search directories such as Bing Places for Business and Google My Business. These are free and are vital to getting new local clients. Every business is in the social media nowadays. It is the best ground to start building a community and a following of people who love your products. There is a plethora of ways you could engage with potential and current clients in the social media platforms and small businesses must never ignore it. Search engine optimization for small businesses is not just affordable but also effective in the long run. While it may take some time before you start to see the results, it will solve a lot of your traffic problems and draw new users to your site. Independent of the size of the business, this is a critical component which must never be ignored."
,
    "url" : "https://tryvitris.com/blog/5-digital-marketing-tips-for-small-businesses/",
    "publisher" : {
        "@type" : "Organization",
        "name" : "Vitris"
    }
}