{
    "@context" : "http://schema.org",
    "@type" : "Article",
    "name" : "Critical Aspects of Small Business Websites",
    "author" : {
        "@type" : "Person",
        "name" : "Liam Haley"
    },
    "image" : "https://tryvitris.com/assets/img/mobile-devices.png",
    "articleSection": "Small Business Digital Marketing",
    "articleBody": "Even though not directly, small businesses are always in competition with the industry’s big dogs. In order for these firms to survive, they have to maximize on every opportunity that they have in front of them. A well-designed, optimized, and functional website to give the much-needed presence online is a necessity to set apart a small business from the rest of it’s competition. To create such a website, the following critical aspects must be incorporated Clear Top Navigation  You may decide to have navigation on the sidebar, however this may not be very effective for a small business as users expect the navigation to be on the top. This is where they will look at when searching for other pages on the website.Contact Information As a small business, your contact information must always be easily visible on the website. This information should show the business name, physical address, telephone numbers and business email. It should be fashion in a easily accessible location, preferably on the footer menu in addition to a link on the top navigation. Site security You want to give your visitors the confidence that your website is secure and they should not be afraid of using it. This calls for securing your site with SSL and having the security signature shown on the website. This is especially imperative if you will be collecting sensitive customer information such as credit card numbers. Mobile friendly Mobile users have now surpassed desktop users, and as a small business, this is a critical aspect you must never avoid. It goes without saying that current websites must be mobile-friendly, and as such, it is imperative for you to test your site and ascertain that  it renders okay on mobile devices. Failure to utilize this can result in the loss of clients."
,
    "url" : "https://tryvitris.com/blog/small-business-website-tips",
    "publisher" : {
        "@type" : "Organization",
        "name" : "Vitris",
    "logo" : {
            "@type": "ImageObject",
            "name": "VitrisLogo",
            "width": "314",
            "height": "226",
            "url": "https://tryvitris.com/assets/img/vitris-v.png"
        }
    },
        "datePublished": "2018-06-04",
        "headline" : "Critical Aspects of Small Business Websites",
        "dateModified" : "2018-06-05",
        "mainEntityOfPage" : "Vitris"
}          